{
  "do_sample": true,
  "max_new_tokens": 200,
  "pad_token_id": 50256,
  "repetition_penalty": 1.1,
  "temperature": 0.8,
  "top_p": 0.9,
  "top_k": 50,
  "eos_token_id": 50256,
  "bos_token_id": 50256,
  "model_type": "gpt2",
  "transformers_version": "4.21.0"
}